app/Http/Controllers/Api/TacticsController.php

    public function multiple()
    {
        $multiples = Setting::where('code','multiple_conf')->get(['value'])->pluck('value');
---
select `value` from `setting` where `code` = 'multiple_conf'




        $share = Shares::where('code',$code)->first();
---
select * from `shares` where `code` = 'sz000676' limit 1

            return ['status' => false,'msg' => '系统错误！'];

        }
        $profit_ratio = Setting::where('code','profit_ratio')->first();
---
select * from `setting` where `code` = 'loss_ratio' limit 1


        }

        $diyanfei_base = Setting::where('code','diyanfei_base')->first();

        if(!$diyanfei_base || !is_numeric($diyanfei_base->value)){
---
select * from `setting` where `code` = 'profit_ratio' limit 1
select * from `setting` where `code` = 'diyanfei_base' limit 1


        $cangfei_base = Setting::where('code','cangfei_base')->first();

        if(!$cangfei_base || !is_numeric($cangfei_base->value)){
---
select * from `setting` where `code` = 'cangfei_base' limit 1

    public function tacticsHome($type){

        if($type == 'new'){

            $tactics = Tactics::join('shares','tactics.code','shares.code')->where('shares.is_del',0)->where('tactics.order_status',0)->orderBy('tactics.created_at','desc')->limit(6)->get(['tactics.id','tactics.user_id','tactics.code','tactics.price','tactics.rate','tactics.deal_money','tactics.num','tactics.profit','tactics.created_at']);

        }elseif($type == 'best'){

            $tactics = Tactics::join('shares','tactics.code','shares.code')->where('shares.is_del',0)->where('tactics.order_status',1)->orderBy('tactics.rate','desc')->limit(3)->get(['tactics.id','tactics.user_id','tactics.code','tactics.price','tactics.rate','tactics.deal_money','tactics.num','tactics.profit','tactics.created_at']);
---
select `tactics`.`id`, `tactics`.`user_id`, `tactics`.`code`, `tactics`.`price`, `tactics`.`rate`, `tactics`.`deal_money`, `tactics`.`num`, `tactics`.`profit`, `tactics`.`created_at` from `tactics` inner join `shares` on `tactics`.`code` = `shares`.`code` where `shares`.`is_del` = 0 and `tactics`.`order_status` = 1 order by `tactics`.`rate` desc limit 3