app/Admin/Controllers/AgentController.php

select `id` from `users` where `level` != 0 and `is_del` = 0
---
    public function index_grid($request){
        $grid=new Grid(new User);

        if(Admin::user()->inRoles(['level_1', 'level_2', 'level_3']) && Admin::user()->agent_id){
            $allAgents = User::where('level','>',0)->get();
            // 获取所有子集id
            $agents = getChildren($allAgents,Admin::user()->agent_id);
            $users = User::whereIn('pid',$agents)->where('level','!=',0)->where('is_del',0)->pluck('id');
            $grid->model()->with('level_lower')->with('level_upper')->with('charges')->with('tactics')->whereIn('id',$users);
        }else{
            $users = User::where('level','!=',0)->where('is_del',0)->pluck('id');

select `id` from `users` where `id` in (2, 4, 5, 7, 20, 21, 22, 23, 24, 25, 26, 27) and (`users`.`id` > 0)
select sum(`money`) as aggregate from `users` where `id` in (2, 4, 5, 7, 20, 21, 22, 23, 24, 25, 26, 27)
select sum(`total_commission`) as aggregate from `users` where `id` in (2, 4, 5, 7, 20, 21, 22, 23, 24, 25, 26, 27)
select count(*) as aggregate from `users` where `pid` in (2, 4, 5, 7, 20, 21, 22, 23, 24, 25, 26, 27) and `level` = 0
select sum(`money`) as aggregate from `charges` where `user_id` in (2, 4, 5, 7, 20, 21, 22, 23, 24, 25, 26, 27) and `status` = 1 and `type` in (1, 4)
select sum(`create_money`) as aggregate from `tactics` where `user_id` in (2, 4, 5, 7, 20, 21, 22, 23, 24, 25, 26, 27)
select sum(`return_money`) as aggregate from `tactics` where `user_id` in (2, 4, 5, 7, 20, 21, 22, 23, 24, 25, 26, 27) and `order_status` = 0
select sum(`return_money`) as aggregate from `tactics` where `user_id` in (2, 4, 5, 7, 20, 21, 22, 23, 24, 25, 26, 27) and `order_status` = 1
select sum(`count_deal_money`) as aggregate from `tactics` where `user_id` in (2, 4, 5, 7, 20, 21, 22, 23, 24, 25, 26, 27)
select sum(`count_diyanfei`) as aggregate from `tactics` where `user_id` in (2, 4, 5, 7, 20, 21, 22, 23, 24, 25, 26, 27)
select sum(`diyanfei`) as aggregate from `tactics` where `user_id` in (2, 4, 5, 7, 20, 21, 22, 23, 24, 25, 26, 27) and `order_status` = 0
select count(*) as aggregate from `tactics` where `user_id` in (2, 4, 5, 7, 20, 21, 22, 23, 24, 25, 26, 27) and `order_status` = 0
---
            $users=User::whereIn('pid',$users)->where('level','!=',0)->pluck('id');
        }

        $userIds=User::whereIn('id',$users)->where($where)->pluck("id");
        $data['money']=User::whereIn('id',$userIds)->sum('money');
        $data['total_commission']=User::whereIn('id',$userIds)->sum('total_commission');
        $data['level_lower']=User::whereIn('pid',$userIds)->where('level',0)->count();
        $data['total_charge_money']=Charge::whereIn('user_id',$userIds)->where('status',1)->whereIn('type',[1,4])->sum('money');
        $data['total_tactics_money']=Tactics::whereIn('user_id',$userIds)->sum('create_money');
        $data['position_return_money']=Tactics::whereIn('user_id',$userIds)->where('order_status',0)->sum('return_money');
        $data['clear_return_money']=Tactics::whereIn('user_id',$userIds)->where('order_status',1)->sum('return_money');
        $data['count_deal_money']=Tactics::whereIn('user_id',$userIds)->sum('count_deal_money');
        $data['count_diyanfei']=Tactics::whereIn('user_id',$userIds)->sum('count_diyanfei');
        $data['diyanfei']=Tactics::whereIn('user_id',$userIds)->where('order_status',0)->sum('diyanfei');
        $data['tactics_count']=Tactics::whereIn('user_id',$userIds)->where('order_status',0)->count();

select * from `users` where `users`.`id` = '2' limit 1
---
  	public function delete($id)
    {
        try
        {
            $model=User::with('level_lower')->find($id);